**Data cleaning assignment**

**Problem Statement**

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],

'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],

'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],

'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [18]:
import numpy as np
import pandas as pd

In [20]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', ' (12)', '(British Airways. )', '12. Air France', '"Swiss Air"']})

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).**

In [21]:
df[['FlightNumber']] = df.FlightNumber. fillna(df.FlightNumber.shift(1) + 10)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [22]:
df['FlightNumber'].dtype

dtype('float64')

In [23]:

df['FlightNumber'] = df['FlightNumber'].astype(np.int64)
df['FlightNumber'].dtype

dtype('int64')

In [24]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []                 (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.**

**3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)**

**4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.**

In [25]:
newdf1 = pd.DataFrame(df)
newdf1[['From','To']] = newdf1.From_To.str.split('_', expand=True,)
newdf1.drop(['From_To'], inplace=True, axis=1)
df = pd.DataFrame(newdf1, columns=['From','To','FlightNumber','RecentDelays','Airline'])
df[['From']] = df.From.str.capitalize()
df[['To']]=df.To.str.capitalize()
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []                 (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

**5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.**

In [26]:
delays = pd.DataFrame(pd.Series(x, dtype=int) for x in df.RecentDelays)
delays.columns = ['delay_{}'.format(x+1) for x in delays.columns]
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [27]:
df.drop(['RecentDelays'], inplace=True, axis=1)

In [28]:
df = pd.concat([df, delays], axis=1, sort=False)
df = pd.DataFrame(df, columns=['From','To','FlightNumber','delay_1','delay_2','delay_3','Airline'])
df

       From         To  FlightNumber  ...  delay_2  delay_3              Airline
0    London      Paris         10045  ...     47.0      NaN               KLM(!)
1    Madrid      Milan         10055  ...      NaN      NaN                 (12)
2    London  Stockholm         10065  ...     43.0     87.0  (British Airways. )
3  Budapest      Paris         10075  ...      NaN      NaN       12. Air France
4  Brussels     London         10085  ...     32.0      NaN          "Swiss Air"

[5 rows x 7 columns]